<a href="https://colab.research.google.com/github/jasveenkaur1299/MachineLearning/blob/master/NaiveBayes/Titanic_survival_rate.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [72]:
import pandas as pd
from google.colab import files

In [73]:
uploaded=files.upload()

Saving titanic.csv to titanic (1).csv

In [74]:
df=pd.read_csv('titanic.csv')

In [75]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [76]:
new_df=df[['Pclass','Sex','Age','Fare']]   #taking only necessary features 
new_df.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [77]:
target=df['Survived']             #target_feature is survived or not
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [78]:
dummy=pd.get_dummies(new_df['Sex'])    #to convert male and female to 0 and 1

In [79]:
updated_df=pd.concat([new_df,dummy],axis=1)

In [80]:
updated_df.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [81]:
updated_df.drop('Sex',axis=1,inplace=True)

In [82]:
updated_df.isna().sum()
updated_df.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [83]:
updated_df['Age']=updated_df['Age'].fillna(updated_df['Age'].mean())

In [84]:
updated_df.isna().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [85]:
count=(updated_df['Age']==40).sum()

In [86]:
count

13

In [87]:
from sklearn.model_selection import train_test_split

In [88]:
X_train, X_test, y_train, y_test = train_test_split(updated_df, target, test_size=0.2, random_state=42)

In [89]:
from sklearn.naive_bayes import GaussianNB

In [90]:
model=GaussianNB()

In [91]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [92]:
len(X_train)

712

In [93]:
model.score(X_test,y_test)

0.776536312849162

In [94]:
X_test[:10]

     Pclass        Age     Fare  female  male
709       3  29.699118  15.2458       0     1
439       2  31.000000  10.5000       0     1
840       3  20.000000   7.9250       0     1
720       2   6.000000  33.0000       1     0
39        3  14.000000  11.2417       1     0
290       1  26.000000  78.8500       1     0
300       3  29.699118   7.7500       1     0
333       3  16.000000  18.0000       0     1
208       3  16.000000   7.7500       1     0
136       1  19.000000  26.2833       1     0

In [95]:
if (model.predict([[3,14.000000,11.2417,1,0]]))==0:
  print('Dead')
else:
  print('Survived')

Survived

In [98]:
model.score(X_test,y_test)

0.776536312849162

In [99]:
from sklearn.naive_bayes import MultinomialNB

In [102]:
model2=MultinomialNB()

In [103]:
model2.fit(X_train,y_train)

MultinomialNB(alpha=1.0, class_prior=None, fit_prior=True)

In [104]:
model2.score(X_test,y_test)

0.7262569832402235